#define _CRT_SECURE_NO_WARNINGS	1
//整型提升理解
#include <stdio.h>
int main()
{
	char a = 5;
	//5 —— int ——  4个字节 —— 32bit
	//a —— char —— 1个字节 —— 8bit
	//00000000000000000000000000000101 —— 5的补码
	//5要存储到a中，需要截断，所以存在a中的实际上为：00000101
	char b = 127;
	//127 —— int ——  4个字节 —— 32bit
	//b   —— char —— 1个字节 —— 8bit
	//00000000000000000000000001111111 —— 127的补码
	//127要存储到b中，需要截断，所以存在a中的实际上为：01111111
	char c = a + b;//a和b都为有符号的char类型，如要相加就会发生整型提升，且两个符号位为0，所以高位补0
	//a   —— 00000000000000000000000000000101
	//b   —— 00000000000000000000000001111111
	//a+b —— 00000000000000000000000010000100
	//a+b要存储到c中，需要截断，所以存在c中的实际上为：10000100
	printf("%d\n", c);//%d是按照十进制的形式打印有符号的整数，
					  //而c为有符号的char类型，如要打印也会发生整型提升，且c的符号位为1，所以高位补1
	//c   —— 11111111111111111111111110000100 —— 补码
	//负数取反加一得原码 —— 10000000000000000000000001111100 —— -124的原码
	return 0;
}
